# ProhibitSwitchToIssuedRevision Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..RevisionCloudFailures..::..ProhibitSwitchToIssuedRevision Property
BuiltInFailures..::..RevisionCloudFailures Class See Also
---
Can't add cloud to an Issued Revision.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId ProhibitSwitchToIssuedRevision { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ProhibitSwitchToIssuedRevision As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ ProhibitSwitchToIssuedRevision {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..RevisionCloudFailures Class
Autodesk.Revit.DB Namespace